{
  "data": {
    "lesson": {
      "id": 1020232,
      "key": "8ae4b836-3e83-4de0-ac99-9de8e539566f",
      "title": "Project: SwiftTech Report",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Apply the skills you have acquired to analyze data provided about a fictional technology company and create fundamental components of the company’s GRC program.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": {
        "files": [
          {
            "name": "Videos Zip File",
            "uri": "https://zips.udacity-data.com/8ae4b836-3e83-4de0-ac99-9de8e539566f/1020232/1600802672353/Project%3A+SwiftTech+Report+Videos.zip"
          },
          {
            "name": "Transcripts Zip File",
            "uri": "https://zips.udacity-data.com/8ae4b836-3e83-4de0-ac99-9de8e539566f/1020232/1600802670933/Project%3A+SwiftTech+Report+Subtitles.zip"
          },
          {
            "name": "SwiftTech Project",
            "uri": "https://video.udacity-data.com/topher/2020/June/5ee8ebbd_swifttech-project/swifttech-project.docx"
          },
          {
            "name": "SwiftTech GLC MSA",
            "uri": "https://video.udacity-data.com/topher/2020/June/5ee8ebd7_swifttech-glc-msa/swifttech-glc-msa.docx"
          },
          {
            "name": "SwiftTech Diagrams",
            "uri": "https://video.udacity-data.com/topher/2020/June/5ee8ebe1_swifttech-diagrams/swifttech-diagrams.pptx"
          },
          {
            "name": "RiskAssessment",
            "uri": "https://video.udacity-data.com/topher/2020/June/5ee8ebed_riskassessment/riskassessment.xlsx"
          },
          {
            "name": "Information Security Policy",
            "uri": "https://video.udacity-data.com/topher/2020/June/5ee8ebfb_information-security-policy/information-security-policy.docx"
          },
          {
            "name": "Risk Assessment - CSV Format",
            "uri": "https://video.udacity-data.com/topher/2020/July/5f19e3a4_riskassessment-assessment/riskassessment-assessment.csv"
          }
        ],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": {
        "key": "d92b8130-21fc-4796-9548-13968674ce08",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 30240,
        "semantic_type": "Project",
        "title": "Project: Create the SwiftTech GRC Program",
        "description": "Once project is completed, the slideshow presentation should be uploaded through a zip file. ",
        "is_public": true,
        "summary": null,
        "forum_path": "",
        "rubric_id": "2856",
        "terminal_project_id": null,
        "resources": null,
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 1036580,
          "key": "6cd8081d-7f6d-4316-aee7-4e0d06ace3a1",
          "title": "Project Overview",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "6cd8081d-7f6d-4316-aee7-4e0d06ace3a1",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1044522,
              "key": "9d511f3a-bb20-43b6-a2be-489617195eee",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Project Overview",
              "instructor_notes": ""
            },
            {
              "id": 1043420,
              "key": "8a4c11a5-2174-458b-a081-cd20a2884d43",
              "title": "ND545 C4 L0 07 Project- SwiftTech Report Video",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "oWiP61is6eo",
                "china_cdn_id": "oWiP61is6eo.mp4"
              }
            },
            {
              "id": 1043727,
              "key": "cf7d4046-f3e4-4d66-bfa8-b6793a52a472",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "In this project, you will apply the skills you have acquired to analyze data provided about a fictional technology company and create fundamental components of the company’s GRC program.  \n\nIn particular, you will identify potentially relevant compliance obligations, modify a risk management policy to meet the company’s specific needs, assess risks apparent in the company’s infrastructure leveraging common risk management frameworks, and develop governance activities to ensure security controls are operating as expected.\n\nThe following materials will be to provided in order to complete the project:  \n- A narrative describing the company, its business goals, and appetite for risk\n- Network and data flow diagrams \n- A partial cybersecurity risk management policy\n- A partial risk management framework.  \n\nFinal implementation of these project components will showcase your ability to interpret business strategy as a function of risk management and develop primary GRC components to enhance the business’ security posture.\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1036585,
          "key": "c8a67f97-e0be-4d92-9f6f-78b35101065b",
          "title": "Project Documents",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "c8a67f97-e0be-4d92-9f6f-78b35101065b",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1044524,
              "key": "cb03a6a7-e2f0-409f-be6a-b82c4d5e8bf7",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Project Documents",
              "instructor_notes": ""
            },
            {
              "id": 1036586,
              "key": "cc8dad33-8aef-4b06-8c90-25e2410a5a53",
              "title": "Project Materials",
              "semantic_type": "TaskListAtom",
              "is_public": true,
              "instructor_notes": null,
              "user_state": {
                "node_key": "cc8dad33-8aef-4b06-8c90-25e2410a5a53",
                "completed_at": null,
                "last_viewed_at": null,
                "unstructured": null
              },
              "tasks": [
                "[Project Overview Document](https://video.udacity-data.com/topher/2020/June/5ee8ebbd_swifttech-project/swifttech-project.docx)",
                "[SwitchTech GLC MSA](https://video.udacity-data.com/topher/2020/June/5ee8ebd7_swifttech-glc-msa/swifttech-glc-msa.docx)",
                "[SwiftTech Diagrams](https://video.udacity-data.com/topher/2020/June/5ee8ebe1_swifttech-diagrams/swifttech-diagrams.pptx)",
                "[Risk Assessment Spreadsheet](https://video.udacity-data.com/topher/2020/July/5f19e3a4_riskassessment-assessment/riskassessment-assessment.csv)",
                "[Information Security Policy Document](https://video.udacity-data.com/topher/2020/June/5ee8ebfb_information-security-policy/information-security-policy.docx)"
              ],
              "positive_feedback": "Awesome! You're ready to begin the project.",
              "video_feedback": null,
              "description": "You should have all these items before starting the project!"
            }
          ]
        },
        {
          "id": 1043728,
          "key": "419da6f9-b9c3-4e79-b0b1-1f3ade46eb85",
          "title": "Welcome E-mail",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "419da6f9-b9c3-4e79-b0b1-1f3ade46eb85",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1043737,
              "key": "31d89c72-fc91-4f49-a043-b8a315b177aa",
              "title": null,
              "semantic_type": "ImageAtom",
              "is_public": true,
              "url": "https://video.udacity-data.com/topher/2020/July/5f037c1c_screen-shot-2020-07-06-at-3.31.23-pm/screen-shot-2020-07-06-at-3.31.23-pm.png",
              "non_google_url": "https://s3.cn-north-1.amazonaws.com.cn/u-img/31d89c72-fc91-4f49-a043-b8a315b177aa",
              "caption": "",
              "alt": "",
              "width": 1598,
              "height": 898,
              "instructor_notes": null
            },
            {
              "id": 1043729,
              "key": "e6c1836a-016d-44d6-9dfb-f13e52a7cd63",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Congratulations!  \n\nYou have recently been hired by SwiftTech as a Cybersecurity GRC analyst!  It’s a great opportunity for you and the timing couldn’t be better for SwiftTech.  SwiftTech prides itself on being first-to-market with innovative technology solutions that improve work efficiency for companies around the globe.  Part of SwiftTech’s success hinges on their ability to overcome obstacles and do everything in their power to develop new ideas as quickly as possible.  Their latest product is a Software-as-a-Service (SaaS) solution that makes Project Tracking a breeze.  The beta launch has already gotten amazing reviews and some analysts are saying that SwiftTech’s ProTrackPlus is a real contender to displace big name legacy Project Tracking software.  In fact, SwiftTech has already lined up some potential large customers.  A large healthcare system in the state of Minnesota has asked SwiftTech to participate in a Request for Proposal (RFP) process for new project management software.  The government of the United Kingdom has also contacted SwiftTech about its software to replace project management software already being used by a number of government agencies. \n\nSwiftTech does have a number of hurdles ahead.  SwiftTech started off as a relatively small company.  Their flagship product, GreenGrass – a contact management system, was designed and built to be installed on customer owned hardware in a physical location.  ProTrackPlus is SwiftTech’s first foray into SaaS.  SwiftTech wants to follow best practices as they relate to SaaS but they don’t want to sacrifice their commitment to agile software development and failing fast.  SwiftTech’s motto is: Speed, Flexibility, Success!\nThe major challenge for SwiftTech, however, is that they face a rapidly changing customer landscape that demands a higher level of vendor scrutiny.  Prospective customers now expect new vendors to sign complex Master Service Agreements which dictate specific requirements for cybersecurity and governance, risk, and compliance programs.  Many of the requirements are rooted in regulatory compliance or a potential customer’s appetite for risk.  They also, at a minimum, expect SaaS vendors to provide a SOCII report which helps establish a baseline for cybersecurity controls and validates their effectiveness. \n\nSwiftTech does not currently have a SOCII report but they recently hired an outside firm, Firehawk Security, to perform a readiness assessment in preparation for pursuing a SOCII attestation report. SwiftTech’s Chief Information Security Officer (CISO) has asked that you review Firehawk Security’s recommendations and follow through on several action items. ",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1043730,
          "key": "d6b7cc6c-a220-4ef5-a30f-99dd0cd69ceb",
          "title": "CISO E-mail",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "d6b7cc6c-a220-4ef5-a30f-99dd0cd69ceb",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1044526,
              "key": "a1a8b883-da59-4843-a7c2-4bee350e0b53",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# CISO E-mail",
              "instructor_notes": ""
            },
            {
              "id": 1043735,
              "key": "077bdb9e-1e6c-4e6b-b464-90eae8354ef6",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Welcome to SwiftTech!  As we discussed during your interview, SwiftTech is very interested in obtaining a SOCII attestation report.  We recently hired Firehawk Security to perform a readiness assessment and I’d like for you take lead on remediating some of their findings/recommendations.  I know you’re the right person for the job.  Specifically, I would like for you to:\n\n1.       **Security Posture** - Write a paragraph that explains SwiftTech’s overall cybersecurity risk posture.  You know a little about SwiftTech’s goals and what drives its success.  In the first sentence, you should describe SwiftTech’s cybersecurity risk posture as Risk Accepting, Risk Neutral, or Risk Averse.  In the remainder of the paragraph, please go on to explain why you chose your position on SwiftTech’s risk posture and support your explanation with key facts from your knowledge about SwiftTech.\n\n`Please include your paragraph in a separate slide in the provided presentation`\n\n2.       **Relevant Frameworks** - Based on what you currently understand about potential customers for ProjectTrackPlus and the attached MSA excerpt from a healthcare provider in Minnesota, identify two or three regulatory frameworks, standards, or guidance that you believe we should use to measure our existing security controls and incorporate into our risk management framework.  Please write an explanatory paragraph that clearly identifies the frameworks you’ve chosen and explains why you chose those frameworks.\n\n` Please include your paragraph in a separate slide in the provided presentation `\n\n3.       **Audit Against Frameworks** - After you have identified relevant security frameworks, please examine the attached diagrams.  There is a SwiftTech Network diagram and a Data Flow diagram for our new ProTrackPlus product.  Firehawk has already reviewed these and made notes about some areas of concern.  I want to make sure we’re all on the same page, so I’d like for you to compare their notes against the frameworks you’ve chosen to work from.  You should be able to either validate or discard each concern.  Don’t forget to use the attached MSA as well.  There may be specific security requirements that are more stringent in the MSA than those required by the compliance frameworks you’ve chosen. \n\n` Please annotate your answers in the presentation provided by Firehawk on a separate slide.  For instance, for the first item (which mentions AES-128 encryption) is that the correct level of encryption, is it too low, what should we be using based on your research from item 2 above?`\n\n4.       **Risk Assessment** – We also need to perform a risk assessment this year.  I want to keep it simple, so I went ahead and started a basic risk assessment just using the controls that Firehawk pointed out.  Please only use those items - the same controls that you’ve been working with in Item 3 above.\tBased on your knowledge of GRC can you complete the risk assessment?  Here are a few things to keep in mind: </ol>\n- A control, or lack of a control could create multiple risks\n- I added a second placeholder for any control items that I felt had at least two risks that might be associated.  \n\n<br>\n`Please try to come up with a primary and secondary risk for those items.`\n\n- I also created logical Risk Categories to correspond with each risk.  \n\n` Please choose the risk category that you feel best corresponds to your state risk. Please make sure to include your reasoning as to why a particular risk’s likelihood and impact are scored as high, medium, or low. Make your changes in the included RiskAssessment spreadsheet.`\n\n5.       **Security Policy Development** – I started to put together a new Information Security Policy but, frankly, I’m _too_ swamped to finish it.  I’d like for you to finish writing the policy to incorporate just the sections that relate to the controls pointed out by Firehawk.  Make sure whatever we say in the policy aligns to the best practices that you’ve developed in your previous work and please make sure those practices are explicit in the policy.\n\n- *Be sure to read the whole policy carefully.  There may be something in it that isn’t congruent with our new goals.*\n` Please make your changes directly in the included Security Policy document.`\n\n6.       **Governance** – I’m very concerned about maintaining great End User Management controls.  Based on your assessment of the end-user management controls pointed out by Firehawk, can you please design governance mechanisms to make sure we are always in compliance?  For instance: </ol>\n- *For password length* – how can we make sure all our users always have the right password length (whatever that is based on your assessment) – and successfully audit against the control.\n\n<br>\n` Please include your ideas in a separate slide in the provided presentation `\n\nOh, by the way, can you get all this done by the end of the day?  I’ve got a meeting with our executive leadership team in the morning and they’re expecting a status report.\n\nWelcome aboard!",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  },
  "_deprecated": [
    {
      "name": "non_google_url",
      "reason": "(2016/8/18) Not sure, ask i18n team for reason"
    }
  ]
}